https://github.com/codebasics/py/blob/master/ML/14_naive_bayes/14_naive_bayes_1_titanic_survival_prediction.ipynb
    
    https://www.youtube.com/watch?v=PPeaRc-r1OI&list=PLeo1K3hjS3us_ELKYSj_Fth2tIEkdKXvV&index=56

Naive Bayes Tutorial Part 1: Predicting survival from titanic crash

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("/home/ujjwal/Data_Science/Jupyter_notebook/csv_xlxs_File/titanic_naiveBayes.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [6]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [7]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female

In [8]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [13]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [14]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [15]:
model.fit(X_train,y_train)

GaussianNB()

In [16]:
model.score(X_test,y_test)

0.7835820895522388

In [17]:
X_test[0:10]

     Pclass        Age      Fare  female
871       1  47.000000   52.5542       1
42        3  29.699118    7.8958       0
271       3  25.000000    0.0000       0
511       3  29.699118    8.0500       0
375       1  29.699118   82.1708       1
39        3  14.000000   11.2417       1
32        3  29.699118    7.7500       1
61        1  38.000000   80.0000       1
698       1  49.000000  110.8833       0
371       3  18.000000    6.4958       0

In [18]:
model.predict(X_test[0:10])

array([1, 0, 0, 0, 1, 1, 1, 1, 1, 0])

In [19]:
model.predict_proba(X_test[:10])

array([[0.05433422, 0.94566578],
       [0.9684842 , 0.0315158 ],
       [0.9631736 , 0.0368264 ],
       [0.96851712, 0.03148288],
       [0.01453879, 0.98546121],
       [0.37695711, 0.62304289],
       [0.47300063, 0.52699937],
       [0.01715768, 0.98284232],
       [0.04938536, 0.95061464],
       [0.95886807, 0.04113193]])

Calculate the score using cross validation

In [20]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.76      , 0.752     , 0.776     , 0.75      , 0.77419355])

In [22]:
score=cross_val_score(GaussianNB(),X_train, y_train, cv=5)

In [24]:
score.mean()

0.7624387096774194